# Denison DA210/CS181 Homework 2.a - Step 1

Before you turn this notebook in, make sure everything runs as expected. This is a combination of **restarting the kernel** and then **running all cells**.

Make sure you fill in any place that says `# YOUR CODE HERE` or "YOUR ANSWER HERE".

---

In [8]:
import pandas as pd

---

## Part A: Tidy Data requirements

**Def. 6.1** A data set in the tabular data model is said to be _tidy data_ if it conforms to the following.

1. Each column represents _exactly one variable_ of the data set.  ("TidyData1")
2. Each row represents _exactly one unique (relational) mapping_, that maps from a set of _givens_ (the values of the independent variables) to the values of the depedent variables.  ("TidyData2")
3. _Exactly one table_ is used for each set of mappings involving the same independent variables.  ("TidyData3")

---

**Q1:** Consider the following dataset, represented by `table1`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy, and state why.

In [9]:
table1columns = [  "country-year",       "type",   "count"]
table1data =[ ["Afghanistan-1999",      "cases",       745],
              ["Afghanistan-1999", "population",  19987071],
              ["Afghanistan-2000",      "cases",      2666],
              ["Afghanistan-2000", "population",  20595360],
              [     "Brazil-1999",      "cases",     37737],
              [     "Brazil-1999", "population", 172006362],
              [     "Brazil-2000",      "cases",     80488],
              [     "Brazil-2000", "population", 174504898],
              [      "China-1999",      "cases",    212258],
              [      "China-1999", "population",1272915272],
              [      "China-2000",      "cases",    213766],
              [      "China-2000", "population",1280428583] ]
table1 = pd.DataFrame(table1data, columns=table1columns)
table1

        country-year        type       count
0   Afghanistan-1999       cases         745
1   Afghanistan-1999  population    19987071
2   Afghanistan-2000       cases        2666
3   Afghanistan-2000  population    20595360
4        Brazil-1999       cases       37737
5        Brazil-1999  population   172006362
6        Brazil-2000       cases       80488
7        Brazil-2000  population   174504898
8         China-1999       cases      212258
9         China-1999  population  1272915272
10        China-2000       cases      213766
11        China-2000  population  1280428583

table 1 is not a tidy data because the first column has two variables (country and year) which violates the first requirement, which stated that each column must correspond to exactly one variable. Table 1 also violates

---

**Q2:** Consider the following dataset, represented by `table2`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy, and state why.

In [10]:
table2columns = ["country",  "year",       "type",     "count"]
table2data =[ ["Afghanistan",  1999,      "cases",       745],
              ["Afghanistan",  1999, "population",  19987071],
              ["Afghanistan",  2000,      "cases",      2666],
              ["Afghanistan",  2000, "population",  20595360],
              [     "Brazil",  1999,      "cases",     37737],
              [     "Brazil",  1999, "population", 172006362],
              [     "Brazil",  2000,      "cases",     80488],
              [     "Brazil",  2000, "population", 174504898],
              [      "China",  1999,      "cases",    212258],
              [      "China",  1999, "population",1272915272],
              [      "China",  2000,      "cases",    213766],
              [      "China",  2000, "population",1280428583] ]

table2 = pd.DataFrame(table2data, columns=table2columns)
table2

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

table2 is not a tidy data because its "type" column is an indicator, which violates te second requirement. The type column does not have any values that correspons to an independent variable, and count contains the value for both cases and population.

---

**Q3:** Consider the following dataset, represented by the pair of tables `table3cases` and `table3pop`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy, and state why.

In [11]:
table3casescolumns = ["country", "1999", "2000"]
table3casesdata = [ ["Afghanistan",    745,   2666],
                [     "Brazil",  37737,  80488],
                [      "China", 212258, 213766] ]

table3cases = pd.DataFrame(table3casesdata, columns=table3casescolumns)
table3cases

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

In [12]:
table3popcolumns = ["country", "1999", "2000"]
table3popdata = [ ["Afghanistan",   19987071,   20595360],
                [      "China", 1272915272, 1280428583],
                [     "Brazil",  172006362,  174504898]]
table3pop = pd.DataFrame(table3popdata, columns=table3popcolumns)
table3pop

       country        1999        2000
0  Afghanistan    19987071    20595360
1        China  1272915272  1280428583
2       Brazil   172006362   174504898

table3cases and table3pop are not tidy datas because they violate the first and third requirements. Both of the table have values of year (1999, 2000) as headline of the column, which violate the first requirement for not using variables for column. Additionally, the two tables can be combined by creating two new columns for pop and cases, so they violate the third requirement.

---

**Q4:** Consider the following dataset, represented by the pair of tables `table4cases` and `table4pop`.  Is this data tidy?  If not, list one of the three tidy-data requirements that it does not satisfy, and state why.

In [13]:
table4acolumns = ["country", "year", "cases"]
table4adata = [ ["Afghanistan",  1999,    745],
                ["Afghanistan",  2000,   2666],
                [     "Brazil",  1999,  37737],
                [     "Brazil",  2000,  80488],
                [      "China",  1999, 212258],
                [      "China",  2000, 213766] ]
table4cases = pd.DataFrame(table4adata, columns=table4acolumns)
table4cases

       country  year   cases
0  Afghanistan  1999     745
1  Afghanistan  2000    2666
2       Brazil  1999   37737
3       Brazil  2000   80488
4        China  1999  212258
5        China  2000  213766

In [14]:
table4bcolumns = ["country", "year", "population"]
table4bdata =[ ["Afghanistan",  1999,   19987071],
               ["Afghanistan",  2000,   20595360],
               [     "Brazil",  1999,  172006362],
               [     "Brazil",  2000,  174504898],
               [      "China",  1999, 1272915272],
               [      "China",  2000, 1280428583] ]
table4pop = pd.DataFrame(table4bdata, columns=table4bcolumns)
table4pop

       country  year  population
0  Afghanistan  1999    19987071
1  Afghanistan  2000    20595360
2       Brazil  1999   172006362
3       Brazil  2000   174504898
4        China  1999  1272915272
5        China  2000  1280428583

table4cases and table4pop are not tidy because they can be combined, so they violate the third requirement.

---

## Part B

**Q5:** For the dataset considered in this assignment, what are the independent variables?  What are the dependent variables?

For the dataset used in this assignment, country and year are independent variables, and cases and population are dependent variables.

---

---
## Part C

15 minutes

Who was your partner for this assignment?  If you worked alone, say so instead.

Alone